package ru.groza1337;

/**
 * Интерфейс для работы с углами.
 * Описывает операции над углами, такие как сложение, вычитание, сравнение и преобразование угла в строку.
 */
public interface AngleService {

    /**
     * Возвращает значение угла в градусах.
     * @return Угол в градусах.
     */
    double getDegrees();

    /**
     * Возвращает значение угла в радианах.
     * @return Угол в радианах.
     */
    double getRadians();

    /**
     * Возвращает строковое представление угла в градусах.
     * @return Угол в градусах в формате строки.
     */
    String toString();

    /**
     * Возвращает строковое представление угла в радианах.
     * @return Угол в радианах в формате строки.
     */
    String toStringInRadians();

    /**
     * Складывает текущий угол с переданным углом.
     * @param other Угол для сложения.
     * @return Новый угол как результат сложения.
     */
    Angle add(Angle other);

    /**
     * Складывает текущий угол с переданным углом в радианах.
     * @param other Угол в радианах для сложения.
     * @return Новый угол как результат сложения.
     */
    Angle addRadians(double other);

    /**
     * Вычитает переданный угол из текущего угла.
     * @param other Угол для вычитания.
     * @return Новый угол как результат вычитания.
     */
    Angle subtract(Angle other);

    /**
     * Вычитает переданный угол в радианах из текущего угла.
     * @param other Угол в радианах для вычитания.
     * @return Новый угол как результат вычитания.
     */
    Angle subtractRadians(double other);

    /**
     * Сравнивает текущий угол с переданным углом.
     * @param other Угол для сравнения.
     * @return 0 - если углы равны, -1 - если текущий угол меньше, 1 - если больше.
     */
    int compare(Angle other);

    /**
     * Сравнивает текущий угол с переданным значением в радианах.
     * @param other Угол в радианах для сравнения.
     * @return 0 - если углы равны, -1 - если текущий угол меньше, 1 - если больше.
     */
    int compareWithRadians(double other);

    /**
     * Определяет тип угла (острый, тупой, прямой и т.д.).
     * @return Тип угла.
     */
    AngleType determineAngleType();
}
